app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Sample Five"], ["created_at", "2015-11-01 15:39:56.245205"], ["updated_at", "2015-11-01 15:39:56.245205"]]
---
   def create
      @article = Article.new(article_params)
      @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 5]]
---
   def destroy
      @article = Article.find(params[:id])

      flash.notice = "Article '#{@article.title}' Deleted!"

      @article.destroy