app/controllers/authors_controller.rb

INSERT INTO "authors" ("username", "email", "salt", "crypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save