app/controllers/comments_controller.rb

   def create
     @comment = Comment.new(comment_params)
     @comment.article_id = params[:article_id]

     @comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "Poop"], ["body", "this is terrible"], ["article_id", 3], ["created_at", "2015-11-01 18:18:17.045404"], ["updated_at", "2015-11-01 18:18:17.045404"]]